In [2]:
import pandas as pd

In [2]:
df= pd.read_csv('../data_wedev/data_version_2/education_experience_data.csv')

In [3]:
df2= pd.read_csv('../data_wedev/data_version_2/work_experience_data.csv')

In [4]:
df.sample(5)

,degree,university
646,Cost Accountant,Arak University of Medical Sciences
1088,Business Systems Development Analyst,Georgetown College
1350,Senior Quality Engineer,Police Academy
1379,Systems Administrator I,Morris Brown College
1552,Geological Engineer,"University of Moncton, Shippagan"

In [5]:
df.shape

(2000, 2)

In [6]:
df2.sample(5)

                    last_job_title company_name
636              Financial Advisor      Wordify
1093  Structural Analysis Engineer     Feedfire
1562        Administrative Officer     Topdrive
406                Media Manager I     Linktype
576                      Recruiter        Mynte

In [7]:
df2.shape

(2000, 2)

In [8]:
df3 = df.iloc[:1000]
df4 = df2.iloc[:1000]

In [9]:
df3.rename(columns={'degree':'degree','university':'entity'}, inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [10]:
df4.rename(columns={'last_job_title':'degree','company_name':'entity'}, inplace=True)

In [11]:
df5= pd.concat([df3, df4])

In [13]:
import random
i=['educational experience','work experience']
t = random.choices(i,k=2000)
df5['type'] =t

In [14]:
df5.sample(5)

                         degree              entity                    type
458          Recruiting Manager  Shantou University         work experience
271         Assistant Professor              BlogXS  educational experience
168  Quality Control Specialist             Skilith  educational experience
985           Account Executive       Thoughtbridge  educational experience
794      Programmer Analyst III  Bow Valley College         work experience

In [3]:
df= pd.read_csv('../data_base/csv/experiences.csv')

In [8]:
i = [i+5 for i in range(896)]

In [10]:
import random

In [11]:
t = random.choices(i,k=2000)

In [12]:
df['id_employee'] = t

In [13]:
df1= pd.read_csv('../data_wedev/data_useful/description1.csv')

In [14]:
df2= pd.read_csv('../data_wedev/data_useful/description2.csv')

In [15]:
df3 = pd.concat([df1,df2])

In [16]:
df.sample(5)

,type,degree,entity,id_employee
1792,work experience,Human Resources Assistant III,Twimbo,234
396,educational experience,Staff Scientist,Ghana Institute of Management and Public Admin...,534
1250,educational experience,Compensation Analyst,Mudo,263
680,work experience,VP Product Management,Abilene Christian University,444
586,work experience,Pharmacist,Awadhesh Pratap Singh University,12

In [17]:
result = pd.merge(df.reset_index(),
                  df3.reset_index(), 
                  left_index=True, 
                  right_index=True)

In [22]:
result.sample(5)

,type,degree,entity,id_employee,description
1167,work experience,Web Developer IV,Meedoo,649,24/7
818,educational experience,Physical Therapy Assistant,Gdynia Maritime Academy,282,optimal
258,educational experience,Executive Secretary,Oakton Community College,803,executive
303,educational experience,Software Consultant,Calvary Bible College,559,directional
664,work experience,Geologist IV,Khazar University,154,Self-enabling

In [19]:
result.drop(['index_x','index_y', 'long_description'],axis=1, inplace=True)

In [21]:
result.rename(columns={'short_description':'description'}, inplace=True)

In [23]:
result.to_csv(index=False, path_or_buf = '../data_base/csv/experiences.csv')